{"pages":[],"posts":[{"title":"Hexo Tutorial","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. WorkflowCreate a new draft post1$ hexo new draft \"post-title\" That will create a markdown file named by your title, and an image folder which has the same name in sub directory source\\_drafts\\ Note: the space in title should be replaced by “-“. As this will be a part of url in your blog Write draft blogPut your categories and tags in your markdown file.To insert the cover image in your blog, change the image path to /yyyy/mm/dd/post-title/cover.png after permalinkWrite the article after &lt; !-- more -- &gt;.To insert the image in your blog, put the image file in the image folder Insert image: ![](your image.png) Run server1$ hexo s --draft That will allow you to preview your blog including draft post in local website: http://localhost:4000/ More info: Server Move draft blog to post folder1$ hexo publish \"post-title\" You can run this command when you finish your draft blog, and you want to publish it. Note: When the blog is put into the post folder, you change remove the “-“ in your title. Generate static files12$ hexo clean$ hexo g That will clean and generate your released file in folder .deploy_git More info: Generating Deploy source code to your Github RepositoryIn the Hexo branch123$ git add .$ git commit -m \"comment\"$ git push origin Hexo Deploy to remote sites1$ hexo d More info: Deployment","link":"/2020/04/04/Hexo-Tutorial/"},{"title":"Some tips when using GROUP BY in SQL Server","text":"In this article I would like to present some tips when using the GROUP BY to generate a report in SQL server. Using ROLLUPThe GROUP UP clause is used to group the results of aggregate functions according to a specified column. However, the GROUP BY clause doesn’t perform aggregate operations on multiple levels of a hierarchy. In that case, you can use the ROLL UP to calculate the subtotals and grand totals for a set of columns. See example below: 12345SELECT R.nameNode AS Register, COUNT(*) AS Mark_NumbersFROM C_Node R JOIN C_ClientMark CM ON CM.idNode = R.idNodeWHERE R.isActive = 1 AND CM.isActive = 1GROUP BY ROLLUP (R.nameNode) Results: If you group by two different criterion, the result will give you the subtotal according to your criterion’s order. See example below: 123SELECT brand, category, SUM (sales) salesFROM sales.sales_summaryGROUP BY ROLLUP(category, brand) Results: In this example, the query assumes that there is a hierarchy between brand &amp; category, which is the brand &gt; category. Note: If you change the order of brand and category, the result will be different See the following query: 123SELECT brand, category, SUM (sales) salesFROM sales.sales_summaryGROUP BY ROLLUP(brand, category) Results: Using Grouping SETS (分组集)A grouping set is a group of columns by which you group. It has the similar result as the GROUP BY ROLL UP. When you use GROUP BY by default, it defines a grouping set (brand): 123SELECT brand, SUM (sales) salesFROM sales.sales_summaryGROUP BY brand -- GROUP BY GROUPING SETS (brand) When you use GROUP BY ROLLUP(brand, category), it defines a grouping sets ((brand, category), (brand), ()): 1234SELECT brand, SUM (sales) salesFROM sales.sales_summaryGROUP BY ROLLUP(brand, category) -- GROUP BY GROUPING SETS ((brand, category), (brand), ()) conclusion: we can say that the GROUP BY ROLLUP is a special grouping sets.","link":"/2020/05/12/SQL-Server-Study-GROUPBY/"},{"title":"Driving Lesson Study Summary","text":"I will write my summary of each driving lesson here. Continue updating… Lesson 10 - 10/21/2020 - 看路上标志 看到路上的限速标志，到下一个路口就可以提速，看到路上travaux标志，在travaux的区域里一直都是限速30 在遇到铁轨时，如果你要左转，记得要停在铁轨上（红灯时），为的是让后面的车能够跟上来，避免交通堵塞 在遇到丁字路口时，如果教练没有指示，那就一定有向左向右的禁止标志，要找到 Lesson 9 - 10/14/2020 - 看路上标志 &amp; 地面标记 判断是否在单行道上的标志是，左右都有指示牌，在路口的时候会有stop的标志 在单行道上，如果向左转，立马转到左边的路上准备左转 在双行道上，如果要左转，要找到最右边左转的那跟道路 Lesson 8 - 10/7/2020 - 看路上标志 在路上看到人行道时，头要左右不停的看有没有行人过马路 在看到绿灯时间较长时，脚要放在刹车上随时停车 Lesson 7 - 09/30/2020 - 倒车 路边倒车：挂倒挡，头往车后看，然后手放在方向盘的12点方向，轻抬离合往后倒车。如果后面有车过来需要立即停车，我们在任何时候倒车都没有优先权。 窄路掉头：先观察前方有没有来车，如果没有来车，将方向盘往左打到底，然后转弯到车头抵到马路牙子，需要观察台阶会不会太高。然后将方向盘摆正，直着或者偏向右往后打，这时候头要往车后看，观察后面有没有来车。等倒到车后没路倒的时候，方向盘往左打上路 Lesson 6 - 09/23/2020 - 看后视镜（2） 在变到最左边的道上时，要从右后视镜中观察后面车的速度，如果速度太快需要延迟变道 在城郊线开车时，需要时刻观察后面摩托车的动向，给他们让路 起步加速时油门要稳定加速，不要猛踩 在靠路边停车时，提早把离合踩到底滑行 在下坡路时，如果只是想缓缓下去，只要轻松刹车就可以，如果是想在下坡路起步，轻松刹车，在车子有一定速度的时候抬离合 Lesson 5 - 09/15/2020 - 看后视镜 在减速，转弯，和变道前，先打灯，再看后视镜，然后在转弯前看后视镜和死角，死角就迅速看一眼，然后开始转弯（变道），在看后视镜的时候不要转方向盘。要随时注意右边的自行车道 在过路口转弯的时候不要忘记看stop线和ceder passage，以及人行道上的行人。 需要提前看清地上的线，随时在最右的道上行驶（自行车道消失，有并线标志）。 熄火的时候首先挂一档，然后先踩离合，如果还没有起步，就拧一下车钥匙。 Lesson 4 - 08/25/2020 - 转弯 如果路口是T字型，不需要降到1档，可以踩着刹车保持15km/h的速度过弯 如果路口是十字路口，需要在通过人行道前降到1档，在过弯的时候滑行过弯（踩死离合，同时踩住刹车），随时看情况决定停车还是加速。先往右看，再往左看，需要知道左边的车会不会直接开过去，这种情况需要以最低速度行驶，发现左边的车开过去之后立马加速，因为我有优先权。 如果路口是红绿灯或者是有优先权的十字路口，可以酌情考虑以2档的速度过弯。 在路口的人行道需要时刻观察左右的行人并不停的转头，发现有行人需要及时停下。 如果我需要在路口转弯，并且主干道上有车开过，需要看情况选择停下还是兹离合，等车开过立马踩油门加速转弯。 在路口时速度降到15码有时候并不需要立刻降挡，可以看情况如果路况转好立马踩油门提速。只有速度为0的时候需要换到1档。 Lesson 3 - 08/11/2020 - 减速降档 需要降档的情况（3档）：转弯前，遇到下坡路，前方有红绿灯。 当你在35码的时候，你想要降到30码，你并不需要通过踩刹车来刹车，你可以直接降档来减 (减轻刹车的压力) 如果你的速度超过35码，你可以轻轻踩刹车，然后换挡（3-2），之后不能直接松离合，需要一直兹着离合直到速度降下来。如果发现路况转好可以加速，你可以松开刹车，并且踩油门加速 缓缓起步：tenir plus sur l’embrayage。离合松的的少一点，油门踩的轻一点。 Lesson 2 - 08/07/2020 - 高速，减速降档 降档(retrograder)的时候不用踩刹车 6档降到5档 85km/h，5档到4档 50km/h 在进入圆环之前，需要将速度降到30码，然后退到2档。慢慢的松离合，不用踩刹车，在进入圆环之后，需要把速度控制在20-25km/h 刹车的时候，先踩刹车，最后再踩离合，停下车后再挂入1档 在高速公路，路过缓速带，过路口，不用踩刹车，只需要松开油门，注意观察即可 Lesson 1 - 08/04/2020 - 起步，刹车 起步要先踩油门，然后再松离合器，离合器要一直兹着不放，等车起步了再把离合器全部松掉。(bloquer/tenir l’embrayage) 第一档(ralenti moteur) 8km/h; 第二档 16km/h; 第三档 27km/h 刹车需要stable， 先松油门，然后慢踩刹车，最后实在不行了再踩离合，过程中不能送刹车。停下的时候需要能够完全看到前车的轮子。 转弯的时候需要pousser方向盘，不能tirer。往左转要让左手放到方向盘的12点钟方向，然后向左推方向盘。右转同理用右手推。","link":"/2020/08/22/Driving-lesson-study-summary/"},{"title":"Chrome new cookie attribute SameSite","text":"Introduce of chrome’s new cookie attribute “SameSite = none” after their upgrade of version 80. ContextRecently we met a strange problem in our program: when users finished payment in site A and went back to site B, the cookie of site B was lost. While the site B use a anti-CSRF that always linked to a cookie. the user found an error message in the page said that “Cannot validate CSRF because your session is lost”. After investigating this problem, we found that the chrome introduced a new cookie attribute “SameSite = None” after their upgrade of version 80 that will block the cookie if it’s a cross-site request. IntroductionCookieCookies is a small piece of data that a server sends to the user’s web browser. The browser may store it and send it back with later requests to the same server. Typically, it’s used to tell if two requests came from the same browser - Keeping a user logged-in. For example, It remembers stateful information for the stateless HTTP protocol. The first time browser post a request to the server, the server will return a response with a special cookie. Then the browser will use this cookie in every request if it posts to the same server. Cookie attributeCookies can be secured by properly setting cookie attributes. These attributes are: Secure: True/False Domain: Path: HTTPOnly: True/False Expires: SameSite: Strict/Lax/None New Attribute SameSite = NoneSameSite values can be set to : - Strict: cookie is sent only within the same site - Lax: sent within the same site and in Get request from other sites - None: sent in a secure context (HTTPS) to clearly indicate that the cookie is sent in a third–party context. Before the upgrade of chrome if the attribute of the cookies was not specified it implicitly stated that the cookie was sent in all contexts. The update of Chrome has made explicit this behavior in introducing a new value SameSite=None. As a result cookies without an explicitly SameSite attribute are treated as SameSite = Lax and if they are from third party in POST they are rejected by the browser. Note:You must ensure that you pair SameSite=None with the Secure attribute together. SolutionSet directly in ChromeIf you tap chrome://flags and search keyword SameSite. Then you can disable this sameSite default setting and it will solve the problem. Configuration in the Apache ServerWe have not found any solution that we can configure in the server JBoss ESP 7.0. Either in the file web.xml or in the file context.xml. There has no tag of SameSite. Maybe the newest version of JBoss will introduce this new attribute.However we found that in the apache configuration file we can set the header cookie like this. That will resolve our problem also. 1Header edit Set-Cookie ^(JSESSIONID.*)$ &quot;$1; SameSite=None; Secure&quot; Set in the code directlyThe last solution is to set the cookie attribute directly in the code when the first time the server response the browser: 12String cookieString=\"cookieName=cookieValue; Secure; SameSite=None\"response.setHeader(\"Set-Cookie\", cookieString);","link":"/2020/08/15/Chrome-new-cookie-attribute-SameSite/"},{"title":"Visual Studio Installer Project","text":"In this article I would like to present how to generate a SetUp.exe file for your Winform application. Create a Setup Project for your applicationWhen you are sure that have finished your development for your application (Winform application in my case). You can right click your Solution in Solution Explorer, then click Add new project. In the windows came out, search Installer. then choose Setup Project And create it. Create Primary outputAfter you create your Installer project, you will find three folders in the left of screen: - The folder Application Folder stocks all your project files and resources(documents, images). - The folder User's Desktop can create shortcut in desktop - The folder User's Programs Menu can create shortcut in Program menu. Now right click the folder Application Folder and choose Add project output. In the windows came out, choose your primary project in dropdown list Project. And click OK. In my case, I have some image resource, so I also created a sub folder named Img to stock my images. After you have added your primary output, you can now set some properties for your SetUp application. Right click your Installer project, and select property. In this property windows, you can set your application’s author, your application’s description, and some other properties. Create Desktop &amp; Program Menu shortcutIn the other two folder, you can set up your shortcuts in desktop or program menu. Right click the folder and choose Create shortcut to user's desktop. Then you can name your shortcut and you can also set a icon for your shortcut. (Note: for the shortcut’s icon, only the format .ico is accepted). Add Prerequistes to your installer projectIn some cases, your application need some other dependencies to run it like .Net Framework, then you should include these components when installing it. Right click your installer’s project, select Property =&gt; Prerequisites. In this windows, you can select which prerequisites to install.","link":"/2020/05/17/Visual-Studio-Installer/"},{"title":"Write My First Game: MineSweeper","text":"This is my first game developed by C# WinForm platform. The initial object is to practice my C# level. So the first game jump into my mind is “MineSweeper”. It is enough simple and interesting. In this post I will list my conception and some difficult point during my development. To see my MineSweeper project in github. See also the rule for mineSweeper Class Conception In this application three main objects are used in models: Class Game presents one game, every time when we create or restart a new game, this class is created. Trough this class we have the proprieties like gameResults, flagCounts and gameLevel. Class Square presents every single squares on the board, it is applied to a two-dimension array in class Game. In this class, we have the proprieties like the value of square (-1 for mined, and [0-9] for others), the position in the boards. Also I use an enumeration `` to define the status of square(open, close, flagged…) Class Frame presents the board on the interface. this class takes charges of the drawing function. Every drawing function return a temporary bitmap picture in the backend, and the front interface cover this bitmap to itself. Program process As described as above, every time when we click the mouse, the program enter into different functions defined in object Game according to the different mouse event (left click, right click or both click). And at the end of every function, we call the function drawing in Frame to refresh our frontend interface. Some focal points in my developmentDifferent mouse eventsIn the program, I use many different mouse events. I’d like to list as below by raising order. You can find the completely mouse events definitions here. Note that in my program, I don’t know it’s which click are mouse down or up, I use two properties leftDown and rightDown to keep and record the status of my clicks. MouseMove event: This function is raised when your mouse’s position are changed. I use this event to realize that when I keep holding my left click and moving on the board, all passing squares are pressed down. 1234567891011private void pnlMine_MouseMove(object sender, MouseEventArgs e){ if(game.InGameSize(e.Location) &amp;&amp; !game.Result.HasValue) { if(leftDown) { game.SetSquaresDown(e.Location, rightDown); RefreshFrame(); } }} MouseDown event: This function is called when your mouse is clicked down I use this function to add flag if it’s the right click, also if left click, I will set the property leftDown to be true and use it in mouseUp function later. 123456789101112131415161718192021222324private void pnlMine_MouseDown(object sender, MouseEventArgs e){ if(!game.Result.HasValue) { switch(e.Button) { case MouseButtons.Left: leftDown = true; game.SetSquaresDown(e.Location, rightDown); game.ChangeFace(GameFace.MouthOpen); break; case MouseButtons.Right: rightDown = true; if(!leftDown) game.AddRemoveFlag(e.Location); break; } if(leftDown &amp;&amp; rightDown &amp;&amp; game.InGameSize(e.Location)) game.SetSquaresDown(e.Location, true); RefreshFrame(); }} MouseClick event: This function is called after function MouseDown This function is the most common mouse event, I use it to open a single square if it’s left click. 1234567891011121314private void pnlMine_MouseClick(object sender, MouseEventArgs e){ if(e.Button == MouseButtons.Left &amp;&amp; (!leftDown || !rightDown) &amp;&amp; game.InGameSize(e.Location) &amp;&amp; !game.Result.HasValue) { if(!game.IsStart) { game.StartGame(e.Location); threadTimer.Change(0, 1000); } game.OpenSingleSquare(e.Location); RefreshFrame(); }} MouseUp event: This function is called the moment when your mouse is click up (the position of click up). I use this function to open around squares if it’s both click (leftDown &amp;&amp; rightDown) 12345678910111213141516171819202122private void pnlMine_MouseUp(object sender, MouseEventArgs e){ if(!game.Result.HasValue) { if(leftDown &amp;&amp; rightDown &amp;&amp; game.InGameSize(e.Location)) game.OpenAroundSquares(e.Location); switch(e.Button) { case MouseButtons.Left: leftDown = false; break; case MouseButtons.Right: rightDown = false; break; } game.SetAllSquaresUp(); game.ChangeFace(GameFace.SmileUp); RefreshFrame(); }} The drawing jobsAs this is my first winForm application, I know few about the windows GDI+ technology, fortunately the drawing functions I use in my application is simple enough. Create the frame: When the game is started, the first thing we do is to create the entire frame, To realize that, I created three empty bitmap as temporary buffer image (one for info panel, one for mine panel, and one for main panel) in the frame object. They all have the same size as the frontend frame Create a new bitmap and initialize it by color Gray 123456789bufferMainFrame = new Bitmap(rctGameField.Width, rctGameField.Height);bufferInfoFrame = new Bitmap(rctPnlInfo.Width, rctPnlInfo.Height);bufferTimerFrame = new Bitmap(rctPnlTimer.Width, rctPnlTimer.Height);bufferMineFrame = new Bitmap(rctPnlMine.Width, rctPnlMine.Height);Graphics.FromImage(bufferMainFrame).Clear(GRAY);Graphics.FromImage(bufferInfoFrame).Clear(GRAY);Graphics.FromImage(bufferTimerFrame).Clear(GRAY);Graphics.FromImage(bufferMineFrame).Clear(GRAY); The function Graphics.FromImage(bufferMineFrame) can get the brush of this image.The function Graphics.Clear(GRAY) can clear a picture by a specified color (Gray in here). Draw the squares: In the game, you need to open squares with different value. According to the different value of square, you need to draw different image on the specified position of the temporary image. Function Draw Square123456789101112public Bitmap DrawSquare(Square square){ Graphics g = Graphics.FromImage(bufferMineFrame); int srcY = (int)square.Status + (square.Status == MineStatus.OpenedNumber ? (Square.MaxSquareNum - square.Value) * ImgMineUnitWidth : 0); Rectangle mineRect = new Rectangle(square.Location, new Size(squareSize, squareSize)); Rectangle srcRect = new Rectangle(new Point(0, srcY), new Size(ImgMineUnitWidth, ImgMineUnitWidth)); GraphicsUnit units = GraphicsUnit.Pixel; g.DrawImage(imgMine, mineRect, srcRect, units); return bufferMineFrame;} Function Graphic.DrawImage can draw a specified image on the target frame.imgMine is your image that you choose to put on the target frame, srcRect is the part of your image (imgMine). Refresh the square on the board: As some of you may ask why you have to draw on the temporary bitmap and cover it to the frontend interface ? why we cannot draw the image directly on the frontend board ? There are two reasons:The first is that in my opinion the logic to draw and refresh the image are something in the backend, The frontend interface only call the function in the backend to refresh its frame. The second and more important reason is that if we draw the image directly in frontend frame, when many squares are updated in one time, every seconds the frame is being drawn, that will cause a blink effect. So we choose to draw all the squares in a temporary buffer picture and apply it to the frontend frame only one time. Function to apply the temporary image to the frontend frame12345private void RefreshFrame(){ pnlMine.CreateGraphics().DrawImage(game.GameFrame.MineFrame, ClientRectangle.Location); pnlInfo.CreateGraphics().DrawImage(game.GameFrame.InfoFrame, ClientRectangle.Location);} The function to open the square There are two ways to open the squares, one is to left click a closed square, the around 8 squares need to open if the value equals to 0 The other is to both click an opened square, if it has the same count of flag around it as the value of this square, they need to be expanded also. Both two ways need a recursive function Recursive function123456789101112131415public bool ExpandSquares(Square sq){ bool noError = true; List&lt;Square&gt; lstAroundSquare = sq.GetAroundSquare(squares, false, true); foreach(Square sqAround in lstAroundSquare) { noError &amp;= sqAround.OpenSquare(); gameFrame.DrawSquare(sqAround); if(sqAround.Value == 0) noError &amp;= ExpandSquares(sqAround); } return noError;} Function to get the around squares according different condition123456789101112131415public List&lt;Square&gt; GetAroundSquare(Square[,] squares, bool excludeMine = false, bool excludeOpen = false){ var query = from Square sq in squares where sq.location.X &gt;= this.location.X - squareSize &amp;&amp; sq.location.X &lt;= this.location.X + squareSize &amp;&amp; sq.location.Y &gt;= this.location.Y - squareSize &amp;&amp; sq.location.Y &lt;= this.location.Y + squareSize &amp;&amp; sq.location != this.location select sq; if(excludeMine) query = query.ToList().Where(sq =&gt; !sq.IsMine()); if(excludeOpen) query = query.ToList().Where(sq =&gt; sq.IsClosed()); return query.ToList();} Yates shuffle AlgorithmAlgorithm global12for(int i = n-1; i &gt;= 0; i--) swap(arr[i], arr[rand() % (i+1)]) At start of game, you need to set randomly the mines on the board. And set the value of each square according to the mine count around it. In my application, I use the algorithm Yates shuffle to set my mines. I suppose that in my square array, the first k squares are mines (k is your mine count), and I switch my arr[i] square with a random(arr[0] ~ arr[i-1]) square. And do this for n times. (n is your total squares) After you have set your mines, you need to parse all your mine, and set the value of around square = value + 1. The difficulty is that the first click of a game cannot be a mine. So that change my algorithm. I can only set my mines and value of other squares after the first click on the board. Moreover, the click square should only be 0 so that it can expand a block of squares around it (the around square should not be mine). To solve this problem, I change my function as below The function of Yates shuffle12345678910111213141516171819202122232425262728293031323334353637383940414243private void KnuthShuffleMine(Point point) { Random ran = new Random(); int indexX = point.X / squareSize; int indexY = point.Y / squareSize; Square sqPoint = squares[indexX, indexY]; int indexOffset = sqPoint.GetAroundMineCount(squares) + (sqPoint.IsMine() ? 1 : 0); for(int y = 0; y &lt;= squares.GetLength(1) - 1; y++) { for(int x = 0; x &lt;= squares.GetLength(0) - 1; x++) { // this area cannot be mine if(x &gt;= indexX - 1 &amp;&amp; x &lt;= indexX + 1 &amp;&amp; y &gt;= indexY - 1 &amp;&amp; y &lt;= indexY + 1) squares[x, y].Value = 0; else { Point ranP = GetRandomPoint(ran, x, y, indexX, indexY); int ranSquareValue = ranP.Y * squares.GetLength(0) + ranP.X &lt; mineCount + indexOffset ? -1 : squares[ranP.X, ranP.Y].Value; int value = y * squares.GetLength(0) + x &lt; mineCount + indexOffset ? -1 : squares[x, y].Value; squares[x, y].Value = ranSquareValue; squares[ranP.X, ranP.Y].Value = value; gameFrame.DrawSquare(squares[x, y]); } } } var queryMine = from Square sq in squares where sq.IsMine() select sq; foreach(Square sq in queryMine) { List&lt;Square&gt; lstAroundSquare = sq.GetAroundSquare(squares, true); foreach(Square sqAround in lstAroundSquare) { sqAround.Value += 1; gameFrame.DrawSquare(sqAround); } } } The function to get random point1234567891011121314private Point GetRandomPoint(Random random, int x, int y, int indexX, int indexY){ int ranX; int ranY; int ranT; do { ranT = random.Next(y * squares.GetLength(0) + x, squares.GetLength(0) * squares.GetLength(1) - 1); ranX = ranT % squares.GetLength(0); ranY = ranT / squares.GetLength(0); } while(ranX &gt;= indexX - 1 &amp;&amp; ranX &lt;= indexX + 1 &amp;&amp; ranY &gt;= indexY - 1 &amp;&amp; ranY &lt;= indexY + 1); return new Point(ranX, ranY);} You can find more introduce for this algorithm here ThreadTimer functionAlso, in my game I need a timer to record my scores, and the time should be changed every seconds in the frontend interface. In winForm application there are three methods to create a timer, here I use the System.Threading.Timer, as it create a different thread from the main tread, so it’s the most accurate timer comparing to the other two methods. When create a new game1234if(threadTimer != null) threadTimer.Dispose();threadTimer = new System.Threading.Timer(new TimerCallback(ChangeTime), null, Timeout.Infinite, 1000); Function new System.Threading.Timer(new TimerCallback(ChangeTime), null, Timeout.Infinite, 1000) create a new instance of Timer object.The parameter new TimerCallback(ChangeTime) is the function (in this case ChangeTime) raised every interval time.The parameter null is your parameter of your raised function. In my function I have no parameter to parse, so it’s null.The parameter Timeout.Infinite is the start time of your timer function. If you want to start the timer right now, you can set it to 0.The last parameter is the interval of timer. In my case it’s 1000 mille seconds. 12345678910111213141516171819public delegate void MyInvoke();private void ChangeTime(object value){ if(!game.Result.HasValue) { game.ChangeTime(); pnlTimer.CreateGraphics().DrawImage(game.GameFrame.TimerFrame, ClientRectangle.Location); } else { threadTimer.Dispose(); if(game.Result == true &amp;&amp; game.CheckBreakRecord()) { MyInvoke mi = new MyInvoke(SetNewRecords); BeginInvoke(mi); } }} To note that, as the timer uses a different thread from the main thread, If you want to call/raise the controls in your main thread in this timer function, you need to create another Invoke and use your main thread’s controls in this Invoke, otherwise the program will raise an error. Fix and center my form size123this.StartPosition = System.Windows.Forms.FormStartPosition.CenterScreen;this.FormBorderStyle = System.Windows.Forms.FormBorderStyle.FixedSingle;this.MaximizeBox = false; Note: This code should be put in Form.Designer.cs Save my score when breaking recordsTo save my scores, I use the property of userSetting. The differences between userSetting and appSetting is that appSetting cannot be modified in the program, but with userSetting you can change it or load it in your program. You need to define your all setting properties in your setting.cs file. 1234567891011121314151617181920private void SetNewRecords(){ if(level == GameLevel.Beginner) { this.rankBegItem.Text = \"Beginner: \" + game.TimeRecord; Properties.Settings.Default[\"BegRecord\"] = game.TimeRecord; } else if(level == GameLevel.Intermediate) { this.rankInterItem.Text = \"Intermediate: \" + game.TimeRecord; Properties.Settings.Default[\"InterRecord\"] = game.TimeRecord; } else if(level == GameLevel.Expert) { this.rankExpertItem.Text = \"Expert: \" + game.TimeRecord; Properties.Settings.Default[\"ExpertRecord\"] = game.TimeRecord; } Properties.Settings.Default.Save(); MessageBox.Show(\"You have break a new records: \" + game.TimeRecord);} To load your setting property :game.TimeRecord = Properties.Settings.Default[&quot;InterRecord&quot;]To save your setting property :Properties.Settings.Default[&quot;InterRecord&quot;] = game.TimeRecord;Properties.Settings.Default.Save(); ConclusionThis is my first game developed by C# winForm. At first I think that it’s easy to develop, but in fact I still met some difficulties and it took me about two weeks to finish it. Maybe in the future I would add some another features like music and animation effect to my application.","link":"/2020/05/01/Write-My-First-Game-MineSweeper/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"SQL","slug":"SQL","link":"/tags/SQL/"},{"name":"Driving","slug":"Driving","link":"/tags/Driving/"},{"name":"Life","slug":"Life","link":"/tags/Life/"},{"name":"JavaEE","slug":"JavaEE","link":"/tags/JavaEE/"},{"name":"Http","slug":"Http","link":"/tags/Http/"},{"name":"Visual Studio","slug":"Visual-Studio","link":"/tags/Visual-Studio/"},{"name":"C#","slug":"C","link":"/tags/C/"},{"name":"WinForm","slug":"WinForm","link":"/tags/WinForm/"}],"categories":[{"name":"Tutorial","slug":"Tutorial","link":"/categories/Tutorial/"},{"name":"Develop","slug":"Develop","link":"/categories/Develop/"},{"name":"Life","slug":"Life","link":"/categories/Life/"},{"name":"SQL","slug":"Develop/SQL","link":"/categories/Develop/SQL/"},{"name":"Driving lesson","slug":"Life/Driving-lesson","link":"/categories/Life/Driving-lesson/"},{"name":"Apache","slug":"Develop/Apache","link":"/categories/Develop/Apache/"},{"name":"Project","slug":"Develop/Project","link":"/categories/Develop/Project/"},{"name":"Chrome","slug":"Develop/Apache/Chrome","link":"/categories/Develop/Apache/Chrome/"}]}